
//Первое ДЗ
//Задача 1: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.WriteLine("Начало");
int namber1 = 2;
int namber2 = 3;
int namber3 = 7;
Console.WriteLine("Конец");